""""
Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
"""

print('Ищем произведение пар чисел в списке')
tuple_lists = ([2, 3, 4, 5, 6],
               [2, 3, 5, 6],
               [2, 3, 5, 9, 3],
               [6, 1, 4, 6, 8, 9, 5, 7],
               [1, 5, 6, 8, 3, 2, 7])

for lst in tuple_lists:

    # Алгоритм в одну строку
    print(f'{lst} => {[lst[i] * lst[len(lst)-i-1] for i in range((len(lst)+1) // 2)]}')
